[
  {
    "ISSN": "0305-1048",
    "PMID": "2582368",
    "URL": "http://www.ncbi.nlm.nih.gov/pubmed/2582368",
    "author": [
      {
        "family": "Cornish-Bowden",
        "given": "A"
      }
    ],
    "container-title": "Nucleic acids research",
    "id": "Cornish-Bowden:1985aa",
    "issue": "9",
    "issued": {
      "date-parts": [
        [
          1985
        ]
      ]
    },
    "page": "3021-3030",
    "publisher": "Oxford University Press",
    "title": "Nomenclature for incompletely specified bases in nucleic acid sequences: recommendations 1984",
    "type": "article-journal",
    "volume": "13"
  },
  {
    "ISSN": "0027-8424",
    "PMID": "3162770",
    "URL": "http://www.ncbi.nlm.nih.gov/pubmed/3162770",
    "abstract": "We have developed three computer programs for comparisons of protein and DNA sequences. They can be used to search sequence data bases, evaluate similarity scores, and identify periodic structures based on local sequence similarity. The FASTA program is a more sensitive derivative of the FASTP program, which can be used to search protein or DNA sequence data bases and can compare a protein sequence to a DNA sequence data base by translating the DNA data base as it is searched. FASTA includes an additional step in the calculation of the initial pairwise similarity score that allows multiple regions of similarity to be joined to increase the score of related sequences. The RDF2 program can be used to evaluate the significance of similarity scores using a shuffling method that preserves local sequence composition. The LFASTA program can display all the regions of local similarity between two sequences with scores greater than a threshold, using the same scoring parameters and a similar alignment algorithm; these local similarities can be displayed as a “graphic matrix” plot or as individual alignments. In addition, these programs have been generalized to allow comparison of DNA or protein sequences based on a variety of alternative scoring matrices.",
    "author": [
      {
        "family": "Pearson",
        "given": "W R"
      },
      {
        "family": "Lipman",
        "given": "D J"
      }
    ],
    "container-title": "Proceedings of the National Academy of Sciences of the United States of America",
    "id": "Pearson:1988aa",
    "issue": "8",
    "issued": {
      "date-parts": [
        [
          1988,
          4
        ]
      ]
    },
    "page": "2444-2448",
    "publisher-place": "Department of Biochemistry, University of Virginia, Charlottesville 22908.",
    "title": "Improved tools for biological sequence comparison",
    "type": "article-journal",
    "volume": "85"
  },
  {
    "abstract": "Metabarcoding of environmental DNA (eDNA) and DNA extracted from bulk specimen samples is a powerful tool in studies of biodiversity, diet and ecological interactions as its inherent labelling of amplicons allows sequencing of taxonomically informative genetic markers from many samples in parallel. However, the occurrence of so-called ’tag-jumps’ can cause incorrect assignment of sequences to samples and artificially inflate diversity. Two steps during library preparation of pools of 5’ nucleotide-tagged amplicons have been suggested to cause tag-jumps: (a) T4 DNA polymerase blunt-ending in the end-repair step and (b) postligation PCR amplification of amplicon libraries. The discovery of tag-jumps has led to recommendations to only carry out metabarcoding PCR amplifications with primers carrying twin-tags to ensure that tag-jumps cannot result in false assignments of sequences to samples. As this increases both cost and workload, a metabarcoding library preparation protocol which circumvents the two steps that causes tag-jumps is needed. Here, we demonstrate Tagsteady, a PCR-free metabarcoding Illumina library preparation protocol for pools of nucleotide-tagged amplicons that enables efficient and cost-effective generation of metabarcoding data with virtually no tag-jumps. We use pools of twin-tagged amplicons to investigate the effect of T4 DNA polymerase blunt-ending and postligation PCR on the occurrence of tag-jumps and demonstrate that both blunt-ending and postligation PCR, alone or together, can result in detrimental amounts of tag-jumps (here, up to ca. 49% of total sequences), while leaving both steps out (the Tagsteady protocol) results in amounts of sequences carrying new combinations of used tags (tag-jumps) comparable to background contamination.",
    "author": [
      {
        "family": "Carøe",
        "given": "Christian"
      },
      {
        "family": "Bohmann",
        "given": "Kristine"
      }
    ],
    "container-title": "Mol. Ecol. Resour.",
    "id": "Caroe2020-nw",
    "issue": "6",
    "issued": {
      "date-parts": [
        [
          2020,
          11
        ]
      ]
    },
    "keyword": "amplicon sequencing; environmental DNA; high-throughput sequencing; tag-jumps",
    "page": "1620-1631",
    "title": "Tagsteady: a metabarcoding library preparation protocol to avoid false assignment of sequences to samples",
    "title-short": "Tagsteady",
    "type": "article-journal",
    "volume": "20"
  },
  {
    "DOI": "10.1093/nar/gkp1137",
    "ISSN": "0305-1048,1362-4962",
    "PMID": "20015970",
    "URL": "http://dx.doi.org/10.1093/nar/gkp1137",
    "abstract": "FASTQ has emerged as a common file format for sharing sequencing read data combining both the sequence and an associated per base quality score, despite lacking any formal definition to date, and existing in at least three incompatible variants. This article defines the FASTQ format, covering the original Sanger standard, the Solexa/Illumina variants and conversion between them, based on publicly available information such as the MAQ documentation and conventions recently agreed by the Open Bioinformatics Foundation projects Biopython, BioPerl, BioRuby, BioJava and EMBOSS. Being an open access publication, it is hoped that this description, with the example files provided as Supplementary Data, will serve in future as a reference for this important file format.",
    "author": [
      {
        "family": "Cock",
        "given": "Peter J A"
      },
      {
        "family": "Fields",
        "given": "Christopher J"
      },
      {
        "family": "Goto",
        "given": "Naohisa"
      },
      {
        "family": "Heuer",
        "given": "Michael L"
      },
      {
        "family": "Rice",
        "given": "Peter M"
      }
    ],
    "container-title": "Nucleic acids research",
    "id": "Cock2010-wl",
    "issue": "6",
    "issued": {
      "date-parts": [
        [
          2010,
          4
        ]
      ]
    },
    "page": "1767-1771",
    "title": "The Sanger FASTQ file format for sequences with quality scores, and the Solexa/Illumina FASTQ variants",
    "type": "article-journal",
    "volume": "38"
  },
  {
    "DOI": "10.1093/nar/gkr732",
    "ISSN": "0305-1048,1362-4962",
    "PMID": "21930509",
    "URL": "http://dx.doi.org/10.1093/nar/gkr732",
    "abstract": "Using non-conventional markers, DNA metabarcoding allows biodiversity assessment from complex substrates. In this article, we present ecoPrimers, a software for identifying new barcode markers and their associated PCR primers. ecoPrimers scans whole genomes to find such markers without a priori knowledge. ecoPrimers optimizes two quality indices measuring taxonomical range and discrimination to select the most efficient markers from a set of reference sequences, according to specific experimental constraints such as marker length or specifically targeted taxa. The key step of the algorithm is the identification of conserved regions among reference sequences for anchoring primers. We propose an efficient algorithm based on data mining, that allows the analysis of huge sets of sequences. We evaluate the efficiency of ecoPrimers by running it on three different sequence sets: mitochondrial, chloroplast and bacterial genomes. Identified barcode markers correspond either to barcode regions already in use for plants or animals, or to new potential barcodes. Results from empirical experiments carried out on a promising new barcode for analyzing vertebrate diversity fully agree with expectations based on bioinformatics analysis. These tests demonstrate the efficiency of ecoPrimers for inferring new barcodes fitting with diverse experimental contexts. ecoPrimers is available as an open source project at: http://www.grenoble.prabi.fr/trac/ecoPrimers.",
    "author": [
      {
        "family": "Riaz",
        "given": "Tiayyba"
      },
      {
        "family": "Shehzad",
        "given": "Wasim"
      },
      {
        "family": "Viari",
        "given": "Alain"
      },
      {
        "family": "Pompanon",
        "given": "François"
      },
      {
        "family": "Taberlet",
        "given": "Pierre"
      },
      {
        "family": "Coissac",
        "given": "Eric"
      }
    ],
    "container-title": "Nucleic acids research",
    "id": "Riaz2011-gn",
    "issue": "21",
    "issued": {
      "date-parts": [
        [
          2011,
          11
        ]
      ]
    },
    "page": "e145",
    "title": "ecoPrimers: inference of new DNA barcode markers from whole genome sequence analysis",
    "type": "article-journal",
    "volume": "39"
  },
  {
    "ISSN": "0036-8075",
    "PMID": "2983426",
    "URL": "http://www.ncbi.nlm.nih.gov/pubmed/2983426",
    "abstract": "An algorithm was developed which facilitates the search for similarities between newly determined amino acid sequences and sequences already available in databases. Because of the algorithm’s efficiency on many microcomputers, sensitive protein database searches may now become a routine procedure for molecular biologists. The method efficiently identifies regions of similar sequence and then scores the aligned identical and differing residues in those regions by means of an amino acid replacability matrix. This matrix increases sensitivity by giving high scores to those amino acid replacements which occur frequently in evolution. The algorithm has been implemented in a computer program designed to search protein databases very rapidly. For example, comparison of a 200-amino-acid sequence to the 500,000 residues in the National Biomedical Research Foundation library would take less than 2 minutes on a minicomputer, and less than 10 minutes on a microcomputer (IBM PC).",
    "author": [
      {
        "family": "Lipman",
        "given": "D J"
      },
      {
        "family": "Pearson",
        "given": "W R"
      }
    ],
    "container-title": "Science",
    "id": "Lipman1985-hw",
    "issue": "4693",
    "issued": {
      "date-parts": [
        [
          1985,
          3
        ]
      ]
    },
    "page": "1435-1441",
    "title": "Rapid and sensitive protein similarity searches",
    "type": "article-journal",
    "volume": "227"
  },
  {
    "DOI": "10.1006/jmbi.1990.9999",
    "ISSN": "0022-2836",
    "PMID": "2231712",
    "URL": "http://dx.doi.org/10.1006/jmbi.1990.9999",
    "abstract": "A new approach to rapid sequence comparison, basic local alignment search tool (BLAST), directly approximates alignments that optimize a measure of local similarity, the maximal segment pair (MSP) score. Recent mathematical results on the stochastic properties of MSP scores allow an analysis of the performance of this method as well as the statistical significance of alignments it generates. The basic algorithm is simple and robust; it can be implemented in a number of ways and applied in a variety of contexts including straightforward DNA and protein sequence database searches, motif searches, gene identification searches, and in the analysis of multiple regions of similarity in long DNA sequences. In addition to its flexibility and tractability to mathematical analysis, BLAST is an order of magnitude faster than existing sequence comparison tools of comparable sensitivity.",
    "author": [
      {
        "family": "Altschul",
        "given": "S F"
      },
      {
        "family": "Gish",
        "given": "W"
      },
      {
        "family": "Miller",
        "given": "W"
      },
      {
        "family": "Myers",
        "given": "E W"
      },
      {
        "family": "Lipman",
        "given": "D J"
      }
    ],
    "container-title": "Journal of molecular biology",
    "id": "Altschul1990-ey",
    "issue": "3",
    "issued": {
      "date-parts": [
        [
          1990,
          10
        ]
      ]
    },
    "page": "403-410",
    "title": "Basic local alignment search tool",
    "type": "article-journal",
    "volume": "215"
  }
]
